---
type: DuctFittingAndAccessoryPressureDropUIDataItem
namespace: Autodesk.Revit.UI.Mechanical
version: 2024
members: 5
tags: [revit-api, class]
---

# DuctFittingAndAccessoryPressureDropUIDataItem

`Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIDataItem` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetDuctFittingAndAccessoryData | 2014 | `public DuctFittingAndAccessoryData GetDuctFittingAndAccessoryData ()` |
| Method | GetEntity | 2014 | `public Entity GetEntity ()` |
| Method | SetEntity | 2014 | `public void SetEntity ( Entity entity )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |